AutB_MOD_07_Robust_Programming_With_State_Machine/README.md
```mermaid
---
title: Function Block Enable InOperation Base
---

stateDiagram-v2
    [*] --> Idle
    Idle --> Init : Enable
    Init --> Idle : not Enable
    Init --> InOp
    Init --> Error : SetError
    InOp --> Idle : not Enable
    InOp --> Error : Set Error
    Error --> Idle : not Enable

note left of Idle : InOperation = FALSE    Error = FALSE
note right of Init : InOperation = FALSE     Error = FALSE
note left of InOp : InOperation = TRUE     Error = FALSE
note left of Error : InOperation = FALSE    Error = TRUE
```
